#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=faca93bbc9118c0c1c1807acdaa84d7ba8be409d]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=d23f23716669cf428787c62a15356e732cd08960]
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 0s [id=289540c36dad34e25a51594db6a3f96eef8be8ce]
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 1s [id=Z01305181G23H04WP32YA]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/page"]: Refreshing state... [id=69b989d5-a74f-7514-a803-dcecc4fbcad4]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico/route"]: Refreshing state... [id=b87d5875-a84e-793c-8e0c-b69d8ebf2daa]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found"]: Refreshing state... [id=6777d067-5ba6-919e-5f36-980fa429667e]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found/layout"]: Refreshing state... [id=bf15b80d-9e52-411c-8039-79030585c23e]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico"]: Refreshing state... [id=b71a7172-51a7-026f-fee1-c85aaf62f229]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/_not-found"]: Refreshing state... [id=533feea6-cf78-b987-f63b-2f4771d5ec9d]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found/page"]: Refreshing state... [id=594632b7-b4f0-2cad-2eea-cd6430c02c01]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/"]: Refreshing state... [id=e28146eb-b51d-58b1-9b0e-be985058bf69]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/index"]: Refreshing state... [id=dfd42733-7cbc-76cd-8378-ab00ac3716c2]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/favicon.ico"]: Refreshing state... [id=b0afbc3d-eb9b-9917-ed85-c137893ab1a0]
module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico/layout"]: Refreshing state... [id=522d8b80-aa34-1519-db13-f2c179cd6887]
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=ef5f004c-1e31-39c4-a68f-6a27b7f3b463]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-5d4472c5201b4a88.js"]: Refreshing state... [id=5fffefed-a76a-d855-1b41-dade3afb2811]
module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/index.cache"]: Refreshing state... [id=39a809dc-91f7-96c6-4fb3-53cd4772f8c2]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/93f479601ee12b01-s.p.woff2"]: Refreshing state... [id=eac4327f-734d-e16e-8426-54d73598cd93]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-0043d75de3bc49f5.js"]: Refreshing state... [id=431c59dc-b990-f5cf-efc4-d2777821eb00]
module.single_zone.module.s3_assets.terraform_data.file_sync["file.svg"]: Refreshing state... [id=40d7329f-d154-8a03-5823-f80355a6142d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-6b27c2b7aa38af2d.js"]: Refreshing state... [id=cb77bcd5-a3ed-5d5a-53bb-b317a7b82828]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/HoOCOMOZsx2Hs6Isau0DL/_ssgManifest.js"]: Refreshing state... [id=47db52c4-7d10-af75-19df-90b92c64c3c7]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["globe.svg"]: Refreshing state... [id=60f4e56a-aabf-7501-3c3e-274d6c09a951]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/HoOCOMOZsx2Hs6Isau0DL/_buildManifest.js"]: Refreshing state... [id=4466676b-9bda-ce66-6ac6-e2a1410e893c]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=29ff3a76-e883-8e3a-414a-f3914933b837]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-fc24ce27be459afd.js"]: Refreshing state... [id=3528a619-d6fa-e4ce-4179-71cbf8225555]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-f029a09104d09cbc.js"]: Refreshing state... [id=d27fb3e1-8cd9-4023-4439-2e3dcd766264]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-f05d4252a2cb69eb.js"]: Refreshing state... [id=0f09097a-bdeb-5aad-4db7-abb504a0dade]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/ba015fad6dcf6784-s.woff2"]: Refreshing state... [id=86e33335-9c64-dc31-95d3-f5632b570206]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=eb9122b8-038f-4261-29ef-8b349b08bd65]
module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/500.cache"]: Refreshing state... [id=ecc1ba9c-bfb1-9507-8132-4d0937b8031f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/569ce4b8f30dc480-s.p.woff2"]: Refreshing state... [id=569a4e38-5b2d-f3fe-88f1-527bdabda92d]
module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/_not-found.cache"]: Refreshing state... [id=a1876cda-c4a0-5a88-69e1-9ef800088a32]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/747892c23ea88013-s.woff2"]: Refreshing state... [id=03f6f38f-8f4a-2f5a-67ab-034d99c520e6]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-9382e6c238d9e696.js"]: Refreshing state... [id=cb306ea9-d136-b793-acb3-d197eda7d675]
module.single_zone.module.s3_assets.terraform_data.file_sync["window.svg"]: Refreshing state... [id=fea322f0-2d5a-7fbf-f75b-15a781be5d23]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-c94eb82a0c6a5f4b.js"]: Refreshing state... [id=658af67b-dcd6-429a-bfcf-218892f99142]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/b52e2c77004dc2b2.css"]: Refreshing state... [id=36c46737-a3f6-8871-340f-41ac96f41454]
module.single_zone.module.s3_assets.terraform_data.file_sync["next.svg"]: Refreshing state... [id=3a4c6e17-f8b6-1aa9-347a-25702f8ea170]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-92810b4b4ece63ad.js"]: Refreshing state... [id=92f2b91d-ccd1-c3c0-a2b7-77832517ccf8]
module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/favicon.ico.cache"]: Refreshing state... [id=2ba4d4f0-a77a-c315-7a26-4044960829a6]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/970-e2f6787501588a87.js"]: Refreshing state... [id=b53d28e3-7797-2755-f25c-00dde1d08666]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["vercel.svg"]: Refreshing state... [id=bb14bb5d-dde9-bd1c-a554-c16a0cd13e4f]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=d402f83f-e333-85a3-b887-76bb500f039a]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=09ab129d9ac33a4c621eb0db786bc64bca6c6313]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=95f7bcd2-44e2-8c65-0c3c-f10c88c070d4]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["www_victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_AAAA]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["www_victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=8e6f8263-8630-25c2-0c84-e5d0692e9c55]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e28146eb-b51d-58b1-9b0e-be985058bf69" -> null
      - triggers_replace = [
          - "nextjs",
          - "a18ae95ba6ae82d783c62eb575c5985e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "6777d067-5ba6-919e-5f36-980fa429667e" -> null
      - triggers_replace = [
          - "nextjs",
          - "9553e3aa3d1cb782d540df232817194a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "bf15b80d-9e52-411c-8039-79030585c23e" -> null
      - triggers_replace = [
          - "nextjs",
          - "9ae6b5db66e7371ec5349f35042e5324",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found/page"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "594632b7-b4f0-2cad-2eea-cd6430c02c01" -> null
      - triggers_replace = [
          - "nextjs",
          - "c7288e5a3946fa70bc2d03f3ca3f0ceb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b71a7172-51a7-026f-fee1-c85aaf62f229" -> null
      - triggers_replace = [
          - "nextjs",
          - "aa3d1dc37726eb4374c8b6083a58fa86",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "522d8b80-aa34-1519-db13-f2c179cd6887" -> null
      - triggers_replace = [
          - "nextjs",
          - "acda0b94c3362dd4a5d896d1e0253647",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b87d5875-a84e-793c-8e0c-b69d8ebf2daa" -> null
      - triggers_replace = [
          - "nextjs",
          - "a60e75722956bde002b3c72df7c87687",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/_not-found"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "533feea6-cf78-b987-f63b-2f4771d5ec9d" -> null
      - triggers_replace = [
          - "nextjs",
          - "080b0d3c54ea15c269a6ade2bffa9a7b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/favicon.ico"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b0afbc3d-eb9b-9917-ed85-c137893ab1a0" -> null
      - triggers_replace = [
          - "nextjs",
          - "d1f7b210db4327bfdc26efe5a4b4bf45",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/index"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/layout-HoOCOMOZsx2Hs6Isau0DL/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "dfd42733-7cbc-76cd-8378-ab00ac3716c2" -> null
      - triggers_replace = [
          - "nextjs",
          - "1b77bc5eb7606a924075d62e57a758c3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["HoOCOMOZsx2Hs6Isau0DL/_N_T_/page"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "69b989d5-a74f-7514-a803-dcecc4fbcad4" -> null
      - triggers_replace = [
          - "nextjs",
          - "3693b3df88f2279ce158da0c09e17c0c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "79d939e77fa635db8d8db8b2e9135a7c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "66c6bf29bbcc45d3c62b0f37ab28c396",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "65e9a7a16074c6594adae5c89e462d46",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b3c6c192b4489097a6e875e36f726dfe",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "2111946f77ab25f78a22f08c881b18cb",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a9093dc7e5ea7973c77bf5622befee9c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "aef7d694036a0d8d77b840397dea48ab",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/layout-nlt4egf2D_WLyRZzOWtgk/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0d9fd7ab6c8b3b955f7b4807f44f83fa",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/layout-nlt4egf2D_WLyRZzOWtgk/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "bfef428a791c2bfb054cc3e1ced1818e",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/layout-nlt4egf2D_WLyRZzOWtgk/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b4be799572d4027a2c58548a586e2e7b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["nlt4egf2D_WLyRZzOWtgk/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c5f8c1ec7f5f096adc5f4d65ce7edb11",
        ]
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2024-12-18T21:07:56.971+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:1/invocations" -> (known after apply)
      ~ source_code_hash               = "YDxWREJP+5lsrw+/0B+eJtlNmHMq2ijp4674kJGQGZc=" -> "VdVktTuud6TTeSzlk0UEtnYDNgVvXUyUAQErzjqWtTw="
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "d402f83f-e333-85a3-b887-76bb500f039a" -> (known after apply)
      ~ triggers_replace = [
          ~ "1" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2024-12-18T21:07:56.971+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:1/invocations" -> (known after apply)
      ~ source_code_hash               = "8Bv8sxULwsvAb+OVs/xYJkKmBnMwd9aIJbca19zwfUQ=" -> "bZthvnd1eXUDtvfOOlU69b92Wi44puez2skXmIFszBM="
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "ef5f004c-1e31-39c4-a68f-6a27b7f3b463" -> (known after apply)
      ~ triggers_replace = [
          ~ "1" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "eb9122b8-038f-4261-29ef-8b349b08bd65" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "e74fac7bb1faef615c4a9ed0040baef8" -> "1cd6f91031d3bd113a9c61818a5ff063",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/500.cache"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "ecc1ba9c-bfb1-9507-8132-4d0937b8031f" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "6edcaf9a35a24e20dd1890a58e617235",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/_not-found.cache"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "a1876cda-c4a0-5a88-69e1-9ef800088a32" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "e803c2a90ef83f78da57d273df1bf516",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/favicon.ico.cache"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "2ba4d4f0-a77a-c315-7a26-4044960829a6" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "6dee9fdaf9e8204bac3f1fed87c6e6f2",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["HoOCOMOZsx2Hs6Isau0DL/index.cache"] will be destroyed
  # (because key ["HoOCOMOZsx2Hs6Isau0DL/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "39a809dc-91f7-96c6-4fb3-53cd4772f8c2" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "d12b98947a656c19188c9e2dc2f41eca",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/HoOCOMOZsx2Hs6Isau0DL/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/HoOCOMOZsx2Hs6Isau0DL/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "4466676b-9bda-ce66-6ac6-e2a1410e893c" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "029e52661382cc31d0037ab9155acd1c",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/HoOCOMOZsx2Hs6Isau0DL/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/HoOCOMOZsx2Hs6Isau0DL/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "47db52c4-7d10-af75-19df-90b92c64c3c7" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-3518ad4b8dadbf11.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "14170f182e779a326cd144b9456c56e1",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-92810b4b4ece63ad.js"] will be destroyed
  # (because key ["_next/static/chunks/4bd1b696-92810b4b4ece63ad.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "92f2b91d-ccd1-c3c0-a2b7-77832517ccf8" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "127a4d17c6272d7060e6a17d99d1c279",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-5d4ee2057481b044.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f7a82096632e0e3a0486f3d0be8d999a",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-c94eb82a0c6a5f4b.js"] will be destroyed
  # (because key ["_next/static/chunks/517-c94eb82a0c6a5f4b.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "658af67b-dcd6-429a-bfcf-218892f99142" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "8f1b0520067df0e85eca59004ce8668e",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/970-64d30c14eed7274c.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "37dcfbbe310de741e94261991ce3dca8",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/970-e2f6787501588a87.js"] will be destroyed
  # (because key ["_next/static/chunks/970-e2f6787501588a87.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "b53d28e3-7797-2755-f25c-00dde1d08666" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "ecd9f513c13331684ce544756540a0ae",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-11290efe1983fcd9.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "ec3132338b4d9b2bcc3856a21dd11ac9",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-9382e6c238d9e696.js"] will be destroyed
  # (because key ["_next/static/chunks/app/layout-9382e6c238d9e696.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "cb306ea9-d136-b793-acb3-d197eda7d675" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "eb600ff673d6f72f189451483972104e",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-63c2b495237ec7da.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "da864a6f580115d54233ce96bee5b331",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-f05d4252a2cb69eb.js"] will be destroyed
  # (because key ["_next/static/chunks/app/page-f05d4252a2cb69eb.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "0f09097a-bdeb-5aad-4db7-abb504a0dade" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "65b8c8cfb6465163fe154ac15751d11f",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-6b27c2b7aa38af2d.js"] will be destroyed
  # (because key ["_next/static/chunks/framework-6b27c2b7aa38af2d.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "cb77bcd5-a3ed-5d5a-53bb-b317a7b82828" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "cd4061b5adde896bf2cde6c57e3098a9",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f2dfe71333aaab44443f7641851b57f3",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-5d4472c5201b4a88.js"] will be destroyed
  # (because key ["_next/static/chunks/main-5d4472c5201b4a88.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "5fffefed-a76a-d855-1b41-dade3afb2811" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "4e13333b9f67d80efca725ba4c96cf45",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f99e4b8740c6c2d2273cdf1470ba9ff9",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-fc24ce27be459afd.js"] will be destroyed
  # (because key ["_next/static/chunks/main-app-fc24ce27be459afd.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "3528a619-d6fa-e4ce-4179-71cbf8225555" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b6397c31a5636551408eecf747a38d44",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-d51a06321c7aaaa4.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "c6a2aa32322c550accd8e94d484a09c5",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-20a8446f813eece4.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "90f8fa52fc81a43b394d11c470d0f239",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-f029a09104d09cbc.js"] will be destroyed
  # (because key ["_next/static/chunks/webpack-f029a09104d09cbc.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "d27fb3e1-8cd9-4023-4439-2e3dcd766264" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "fb1b19fbef1326b3cb462eb9501573be",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/nlt4egf2D_WLyRZzOWtgk/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "029e52661382cc31d0037ab9155acd1c",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/nlt4egf2D_WLyRZzOWtgk/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["nlt4egf2D_WLyRZzOWtgk/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "786c0a3bf098bf810f6b6beced6d3df0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["nlt4egf2D_WLyRZzOWtgk/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "874bea56f5180f7f3821a1e042084cfd",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["nlt4egf2D_WLyRZzOWtgk/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "6dee9fdaf9e8204bac3f1fed87c6e6f2",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["nlt4egf2D_WLyRZzOWtgk/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "3d8eeaf4be560dbe7389138cb5c7b3d7",
        ]
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2024-12-18T21:07:58.841+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:1/invocations" -> (known after apply)
      ~ source_code_hash               = "n5ihtLt7UCqFxYGCd+5gCAw0A8/Iy8KL1nYJg2fYYog=" -> "wQ/rwlRpYX2omfKcaiVWbSrT/q7Bq8E0W7di9WjfCS4="
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "95f7bcd2-44e2-8c65-0c3c-f10c88c070d4" -> (known after apply)
      ~ triggers_replace = [
          ~ "1" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 30 to add, 3 to change, 30 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @victorlevasseur, Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*